{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"input_9:0": {"name": "input_9:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "29"}]}}}}}, "modelTopology": {"node": [{"name": "input_9", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_27", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_28", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_36", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_29", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_30", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_37", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_31", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_13", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_32", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^input_9"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_33", "op": "Const", "input": ["^input_9"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^input_9"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_38", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "29"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/global_average_pooling2d_3/Mean/reduction_indices", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_22", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_23", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_34", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_24", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_25", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_35", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_26", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_39", "op": "Const", "input": ["^input_9"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block1_conv1/Relu", "op": "_FusedConv2D", "input": ["input_9", "Func/StatefulPartitionedCall/input/_2", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block1_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block1_conv1/Relu", "Func/StatefulPartitionedCall/input/_4", "Func/StatefulPartitionedCall/input/_5"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block1_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_4/vgg19/block1_conv2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block2_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block1_pool/MaxPool", "Func/StatefulPartitionedCall/input/_6", "Func/StatefulPartitionedCall/input/_7"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block2_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block2_conv1/Relu", "Func/StatefulPartitionedCall/input/_8", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block2_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_4/vgg19/block2_conv2/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block3_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block2_pool/MaxPool", "Func/StatefulPartitionedCall/input/_10", "Func/StatefulPartitionedCall/input/_11"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block3_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block3_conv1/Relu", "Func/StatefulPartitionedCall/input/_12", "Func/StatefulPartitionedCall/input/_13"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block3_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block3_conv2/Relu", "Func/StatefulPartitionedCall/input/_14", "Func/StatefulPartitionedCall/input/_15"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block3_conv4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block3_conv3/Relu", "Func/StatefulPartitionedCall/input/_16", "Func/StatefulPartitionedCall/input/_17"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block3_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_4/vgg19/block3_conv4/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block4_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block3_pool/MaxPool", "Func/StatefulPartitionedCall/input/_18", "Func/StatefulPartitionedCall/input/_19"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block4_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block4_conv1/Relu", "Func/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block4_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block4_conv2/Relu", "Func/StatefulPartitionedCall/input/_22", "Func/StatefulPartitionedCall/input/_23"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block4_conv4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block4_conv3/Relu", "Func/StatefulPartitionedCall/input/_24", "Func/StatefulPartitionedCall/input/_25"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block4_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_4/vgg19/block4_conv4/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block5_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block4_pool/MaxPool", "Func/StatefulPartitionedCall/input/_26", "Func/StatefulPartitionedCall/input/_27"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block5_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block5_conv1/Relu", "Func/StatefulPartitionedCall/input/_28", "Func/StatefulPartitionedCall/input/_29"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block5_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block5_conv2/Relu", "Func/StatefulPartitionedCall/input/_30", "Func/StatefulPartitionedCall/input/_31"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block5_conv4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/vgg19/block5_conv3/Relu", "Func/StatefulPartitionedCall/input/_32", "Func/StatefulPartitionedCall/input/_33"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/vgg19/block5_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_4/vgg19/block5_conv4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model_4/global_average_pooling2d_3/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_4/vgg19/block5_pool/MaxPool", "StatefulPartitionedCall/model_4/global_average_pooling2d_3/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/dense_12/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/global_average_pooling2d_3/Mean", "Func/StatefulPartitionedCall/input/_34", "Func/StatefulPartitionedCall/input/_35"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_4/dense_13/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/dense_12/Relu", "Func/StatefulPartitionedCall/input/_36", "Func/StatefulPartitionedCall/input/_37"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_4/dense_14/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/dense_13/Relu", "Func/StatefulPartitionedCall/input/_38", "Func/StatefulPartitionedCall/input/_39"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_4/dense_14/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_4/dense_14/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_4/dense_14/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of20.bin", "group1-shard2of20.bin", "group1-shard3of20.bin", "group1-shard4of20.bin", "group1-shard5of20.bin", "group1-shard6of20.bin", "group1-shard7of20.bin", "group1-shard8of20.bin", "group1-shard9of20.bin", "group1-shard10of20.bin", "group1-shard11of20.bin", "group1-shard12of20.bin", "group1-shard13of20.bin", "group1-shard14of20.bin", "group1-shard15of20.bin", "group1-shard16of20.bin", "group1-shard17of20.bin", "group1-shard18of20.bin", "group1-shard19of20.bin", "group1-shard20of20.bin"], "weights": [{"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_27", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_28", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_36", "shape": [1024, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_29", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_30", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_37", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_12", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_31", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_13", "shape": [256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_32", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_16", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_17", "shape": [256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_33", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_18", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_38", "shape": [128, 29], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_19", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/global_average_pooling2d_3/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_22", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_23", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_34", "shape": [512, 1024], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_24", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_25", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_35", "shape": [1024], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_26", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_39", "shape": [29], "dtype": "float32"}]}]}